In [37]:
import pandas as pd
import numpy as np
info = np.array([["Andrey", 16, "11I2", "Informatics"], ["Sergey", 17, "11B", "Flight"]])
df = pd.DataFrame(info, columns=['name', 'age','class','hobbie'])
df

     name age class       hobbie
0  Andrey  16  11I2  Informatics
1  Sergey  17   11B       Flight

In [38]:
#прежде чем запустить этот код, запустить верхний
df = df.drop('hobbie', axis=1)
df

     name age class
0  Andrey  16  11I2
1  Sergey  17   11B